<a href="https://colab.research.google.com/github/IshGish/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/W1D3_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-10-02 19:15:35--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.132.45
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.132.45|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  47.0MB/s    in 4.6s

2019-10-02 19:15:40 (42.9 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [0]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [0]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [0]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
import pandas as pd

# First, write down which columns you need and which dataframes have them.
# Need:
#   user_id, order_id, order_number, order_dow, order_hour_of_day, add_to_cart_order, product_id, product_name


# orders.csv:
#   user_id, order_id, order_number, order_dow, order_hour_of_day
# orders_prior
#            order_id,                                             add_to_cart_order, product_id
# orders_train
#            order_id,                                             add_to_cart_order, product_id
# products.csv:
#                                                                                     product_id, product_name

from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)

display(example)

In [0]:
orders = pd.read_csv('orders.csv')
orders = orders.drop(['eval_set', 'days_since_prior_order'], axis=1)
print(orders.shape, '\n', orders.head(), '\n', orders.tail())

(3421083, 5)
    order_id  user_id  order_number  order_dow  order_hour_of_day
0   2539329        1             1          2                  8
1   2398795        1             2          3                  7
2    473747        1             3          3                 12
3   2254736        1             4          4                  7
4    431534        1             5          4                 15
          order_id  user_id  order_number  order_dow  order_hour_of_day
3421078   2266710   206209            10          5                 18
3421079   1854736   206209            11          4                 10
3421080    626363   206209            12          1                 12
3421081   2977660   206209            13          1                 12
3421082    272231   206209            14          6                 14

In [0]:
orders_prior = pd.read_csv('order_products__prior.csv')
orders_prior = orders_prior.drop(['reordered'], axis=1)
print(orders_prior.shape, '\n', orders_prior.head(), '\n', orders_prior.tail())

(32434489, 3)
    order_id  product_id  add_to_cart_order
0         2       33120                  1
1         2       28985                  2
2         2        9327                  3
3         2       45918                  4
4         2       30035                  5
           order_id  product_id  add_to_cart_order
32434484   3421083       39678                  6
32434485   3421083       11352                  7
32434486   3421083        4600                  8
32434487   3421083       24852                  9
32434488   3421083        5020                 10

In [0]:
orders_train = pd.read_csv('order_products__train.csv')
orders_train = orders_train.drop(['reordered'], axis=1)
print(orders_train.shape, '\n', orders_train.head(), '\n', orders_train.tail())

(1384617, 3)
    order_id  product_id  add_to_cart_order
0         1       49302                  1
1         1       11109                  2
2         1       10246                  3
3         1       49683                  4
4         1       43633                  5
          order_id  product_id  add_to_cart_order
1384612   3421063       14233                  3
1384613   3421063       35548                  4
1384614   3421070       35951                  1
1384615   3421070       16953                  2
1384616   3421070        4724                  3

In [0]:
products = pd.read_csv('products.csv')
products = products.drop(['aisle_id', 'department_id'], axis=1)
print(products.shape, '\n', products.head(), '\n', products.tail())

(49688, 2)
    product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce
        product_id                                product_name
49683       49684   Vodka, Triple Distilled, Twist of Vanilla
49684       49685          En Croute Roast Hazelnut Cranberry
49685       49686                            Artisan Baguette
49686       49687  Smartblend Healthy Metabolism Dry Cat Food
49687       49688                      Fresh Foaming Cleanser

In [0]:
# Next, merge these into a single dataframe.

# Concat orders_prior with orders_train
# Then merge orders
# Then merge products

order_products = pd.concat([orders_prior, orders_train], ignore_index=True)

In [0]:
merged = pd.merge(order_products, orders, how='inner', on='order_id')

In [0]:
merged = pd.merge(merged, products, how='inner', on='product_id')

In [0]:
merged.head()

   order_id  product_id  ...  order_hour_of_day        product_name
0         2       33120  ...                  9  Organic Egg Whites
1        26       33120  ...                 16  Organic Egg Whites
2       120       33120  ...                  8  Organic Egg Whites
3       327       33120  ...                  9  Organic Egg Whites
4       390       33120  ...                 12  Organic Egg Whites

[5 rows x 8 columns]

In [0]:
# Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

# Top 10
# 1. Banana
# 2. Bag of Organic Bananas
# 3. Organic Strawberries
# 4. Organic Baby Spinach 
# 5. Organic Hass Avocado
# 6. Organic Avocado
# 7. Large Lemon 
# 8. Strawberries
# 9. Limes 
# 10. Organic Whole Milk

# Decided to give each one it's own space to work, else it'd probably crash.

In [0]:
merged['product_name'].str.match('Banana').sum()

519761

In [0]:
merged['product_name'].str.match('Bag of Organic Bananas').sum()

394930

In [0]:
merged['product_name'].str.match('Organic Strawberries').sum()

276484

In [0]:
merged['product_name'].str.match('Organic Baby Spinach').sum()

270087

In [0]:
merged['product_name'].str.match('Organic Hass Avocado').sum()

223133

In [0]:
merged['product_name'].str.match('Organic Avocado').sum()

190961

In [0]:
merged['product_name'].str.match('Large Lemon').sum()

160792

In [0]:
merged['product_name'].str.match('Strawberries').sum()

150605

In [0]:
merged['product_name'].str.match('Limes').sum()

146660

In [0]:
merged['product_name'].str.match('Organic Whole Milk').sum()

172960

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
# Replicate lesson code
# Make Table 2 tidy, then revert it without using this code:
# table2.T.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

### Table 1 -> Tidy

In [0]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [0]:
tidy = table1.reset_index()
tidy = tidy.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy = tidy.rename(columns={
    'index': 'name', 
    'variable': 'trt', 
    'value': 'result'
})
tidy['trt'] = tidy['trt'].str.replace('treatment', '')

tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

### Table 2 -> Tidy

In [0]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
tidy = table2.reset_index()
tidy = tidy.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy = tidy.rename(columns={
    'index' : 'trt', 
    'variable' : 'name', 
    'value' : 'result'
})
tidy['trt'] = tidy['trt'].str.replace('treatment', '')

# Despite how long I spent on this, it looks like reorganizing the list was as
# easy as just stating that's how it should be.
tidy = tidy[['name', 'trt', 'result']]

tidy

           name trt  result
0    John Smith   a     NaN
1    John Smith   b     2.0
2      Jane Doe   a    16.0
3      Jane Doe   b    11.0
4  Mary Johnson   a     3.0
5  Mary Johnson   b     1.0

### Tidy -> Table 2

In [0]:
tidy = tidy[['trt', 'name', 'result']]
tidy['trt'] = tidy['trt'].str.replace('a', 'treatmenta')
tidy['trt'] = tidy['trt'].str.replace('b', 'treatmentb')
tidy = tidy.rename(columns={
    'trt' : 'index',
    'name' : 'variable',
    'result' : 'value'
})
table2 = tidy.pivot(index='index', columns='variable', values='value')
table2 = table2[['John Smith', 'Jane Doe', 'Mary Johnson']]

table2
# I have no clue why it adds in that 'variab;e' name above everything else but
# I haven't found a way yet to remove it.

variable    John Smith  Jane Doe  Mary Johnson
index
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

### Flights pivoting

In [0]:
import seaborn as sns
flights = sns.load_dataset('flights')
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [0]:
# Create a pivot table showing the number of passengers by month and year.
# Use year for the index and month for the columns.
# You've done it right if you get 112 passengers for January 1949 and
# 432 passengers for December 1960.

flights.pivot(index='year', columns='month')

      passengers                       ...
month    January February March April  ... September October November December
year                                   ...
1949         112      118   132   129  ...       136     119      104      118
1950         115      126   141   135  ...       158     133      114      140
1951         145      150   178   163  ...       184     162      146      166
1952         171      180   193   181  ...       209     191      172      194
1953         196      196   236   235  ...       237     211      180      201
1954         204      188   235   227  ...       259     229      203      229
1955         242      233   267   269  ...       312     274      237      278
1956         284      277   317   313  ...       355     306      271      306
1957         315      301   356   348  ...       404     347      305      336
1958         340      318   362   348  ...       404     359      310      337
1959         360      342   406   396  ...       463     407      362      405
1960         417      391   419   461  ...       508     461      390      432

[12 rows x 12 columns]

In [0]:
flights

Index(['year', 'month', 'passengers'], dtype='object')

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####